cask_args appdir: '/Applications'

# homebrew&cask
tap 'caskroom/cask'
tap 'homebrew/binary'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/versions'
tap 'rcmdnk/file'

# package
brew 'autoconf'
brew 'awscli'
brew 'bison'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'pixman'
brew 'cairo'
brew 'curl'
brew 'dnsmasq'
brew 'gdbm'
brew 'giflib'
brew 'hub'
brew 'jpeg'
brew 'libtiff'
brew 'libtool'
brew 'xz'

# development
brew 'imagemagick'
brew 'jq'
brew 'mongodb'
brew 'mysql'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'qt'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-gemset'
brew 'redis'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'zsh', args: ['without-etcdir']
brew 'rcmdnk/file/brew-file'

# Cask Packages
# Step:
#   brew cask search ~
#   brew cask install~
cask 'iterm2'
cask 'alfred'
cask 'caffeine'
cask 'dash'
cask 'skitch'
cask 'evernote'
cask 'dropbox'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'mysqlworkbench'
cask 'sequel-pro'
cask 'firefox'
cask 'google-chrome'
cask 'virtualbox'
cask 'vagrant'
cask 'sublime-text'
cask 'phpstorm'
cask 'psequel'
cask 'eclipse-ide'
cask 'cyberduck'
cask 'the-unarchiver'
cask 'imageoptim'
cask 'speedlimit'
cask 'colors'
cask 'sitesucker'
cask 'google-japanese-ime'
# add from Jul 2014
cask 'sqlitebrowser'
'
# editor'
cask 'visual-studio-code'
cask 'atom'
